{
  "class_name": "Sequential", 
  "keras_version": "1.1.1", 
  "config": [
    {
      "class_name": "Layer", 
      "config": {
        "batch_input_shape": [
          null, 
          3, 
          360, 
          480
        ], 
        "trainable": true, 
        "name": "layer_1", 
        "input_dtype": "float32"
      }
    }, 
    {
      "class_name": "ZeroPadding2D", 
      "config": {
        "padding": [
          1, 
          1
        ], 
        "trainable": true, 
        "name": "zeropadding2d_1"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_1", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 3, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 64, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 3, 
        "activation": "linear", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "BatchNormalization", 
      "config": {
        "gamma_regularizer": null, 
        "name": "batchnormalization_1", 
        "epsilon": 1e-05, 
        "trainable": true, 
        "mode": 0, 
        "beta_regularizer": null, 
        "momentum": 0.99, 
        "axis": -1
      }
    }, 
    {
      "class_name": "Activation", 
      "config": {
        "activation": "relu", 
        "trainable": true, 
        "name": "activation_1"
      }
    }, 
    {
      "class_name": "MaxPooling2D", 
      "config": {
        "name": "maxpooling2d_1", 
        "trainable": true, 
        "dim_ordering": "th", 
        "pool_size": [
          2, 
          2
        ], 
        "strides": [
          2, 
          2
        ], 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "ZeroPadding2D", 
      "config": {
        "padding": [
          1, 
          1
        ], 
        "trainable": true, 
        "name": "zeropadding2d_2"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_2", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 3, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 128, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 3, 
        "activation": "linear", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "BatchNormalization", 
      "config": {
        "gamma_regularizer": null, 
        "name": "batchnormalization_2", 
        "epsilon": 1e-05, 
        "trainable": true, 
        "mode": 0, 
        "beta_regularizer": null, 
        "momentum": 0.99, 
        "axis": -1
      }
    }, 
    {
      "class_name": "Activation", 
      "config": {
        "activation": "relu", 
        "trainable": true, 
        "name": "activation_2"
      }
    }, 
    {
      "class_name": "MaxPooling2D", 
      "config": {
        "name": "maxpooling2d_2", 
        "trainable": true, 
        "dim_ordering": "th", 
        "pool_size": [
          2, 
          2
        ], 
        "strides": [
          2, 
          2
        ], 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "ZeroPadding2D", 
      "config": {
        "padding": [
          1, 
          1
        ], 
        "trainable": true, 
        "name": "zeropadding2d_3"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_3", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 3, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 256, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 3, 
        "activation": "linear", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "BatchNormalization", 
      "config": {
        "gamma_regularizer": null, 
        "name": "batchnormalization_3", 
        "epsilon": 1e-05, 
        "trainable": true, 
        "mode": 0, 
        "beta_regularizer": null, 
        "momentum": 0.99, 
        "axis": -1
      }
    }, 
    {
      "class_name": "Activation", 
      "config": {
        "activation": "relu", 
        "trainable": true, 
        "name": "activation_3"
      }
    }, 
    {
      "class_name": "MaxPooling2D", 
      "config": {
        "name": "maxpooling2d_3", 
        "trainable": true, 
        "dim_ordering": "th", 
        "pool_size": [
          2, 
          2
        ], 
        "strides": [
          2, 
          2
        ], 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "ZeroPadding2D", 
      "config": {
        "padding": [
          1, 
          1
        ], 
        "trainable": true, 
        "name": "zeropadding2d_4"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_4", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 3, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 512, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 3, 
        "activation": "linear", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "BatchNormalization", 
      "config": {
        "gamma_regularizer": null, 
        "name": "batchnormalization_4", 
        "epsilon": 1e-05, 
        "trainable": true, 
        "mode": 0, 
        "beta_regularizer": null, 
        "momentum": 0.99, 
        "axis": -1
      }
    }, 
    {
      "class_name": "Activation", 
      "config": {
        "activation": "relu", 
        "trainable": true, 
        "name": "activation_4"
      }
    }, 
    {
      "class_name": "ZeroPadding2D", 
      "config": {
        "padding": [
          1, 
          1
        ], 
        "trainable": true, 
        "name": "zeropadding2d_5"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_5", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 3, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 512, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 3, 
        "activation": "linear", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "BatchNormalization", 
      "config": {
        "gamma_regularizer": null, 
        "name": "batchnormalization_5", 
        "epsilon": 1e-05, 
        "trainable": true, 
        "mode": 0, 
        "beta_regularizer": null, 
        "momentum": 0.99, 
        "axis": -1
      }
    }, 
    {
      "class_name": "UpSampling2D", 
      "config": {
        "trainable": true, 
        "name": "upsampling2d_1", 
        "size": [
          2, 
          2
        ]
      }
    }, 
    {
      "class_name": "ZeroPadding2D", 
      "config": {
        "padding": [
          1, 
          1
        ], 
        "trainable": true, 
        "name": "zeropadding2d_6"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_6", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 3, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 256, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 3, 
        "activation": "linear", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "BatchNormalization", 
      "config": {
        "gamma_regularizer": null, 
        "name": "batchnormalization_6", 
        "epsilon": 1e-05, 
        "trainable": true, 
        "mode": 0, 
        "beta_regularizer": null, 
        "momentum": 0.99, 
        "axis": -1
      }
    }, 
    {
      "class_name": "UpSampling2D", 
      "config": {
        "trainable": true, 
        "name": "upsampling2d_2", 
        "size": [
          2, 
          2
        ]
      }
    }, 
    {
      "class_name": "ZeroPadding2D", 
      "config": {
        "padding": [
          1, 
          1
        ], 
        "trainable": true, 
        "name": "zeropadding2d_7"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_7", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 3, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 128, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 3, 
        "activation": "linear", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "BatchNormalization", 
      "config": {
        "gamma_regularizer": null, 
        "name": "batchnormalization_7", 
        "epsilon": 1e-05, 
        "trainable": true, 
        "mode": 0, 
        "beta_regularizer": null, 
        "momentum": 0.99, 
        "axis": -1
      }
    }, 
    {
      "class_name": "UpSampling2D", 
      "config": {
        "trainable": true, 
        "name": "upsampling2d_3", 
        "size": [
          2, 
          2
        ]
      }
    }, 
    {
      "class_name": "ZeroPadding2D", 
      "config": {
        "padding": [
          1, 
          1
        ], 
        "trainable": true, 
        "name": "zeropadding2d_8"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_8", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 3, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 64, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 3, 
        "activation": "linear", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "BatchNormalization", 
      "config": {
        "gamma_regularizer": null, 
        "name": "batchnormalization_8", 
        "epsilon": 1e-05, 
        "trainable": true, 
        "mode": 0, 
        "beta_regularizer": null, 
        "momentum": 0.99, 
        "axis": -1
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_9", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 1, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 12, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 1, 
        "activation": "linear", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "Reshape", 
      "config": {
        "target_shape": [
          12, 
          172800
        ], 
        "batch_input_shape": [
          null, 
          12, 
          360, 
          480
        ], 
        "trainable": true, 
        "name": "reshape_1", 
        "input_dtype": "float32"
      }
    }, 
    {
      "class_name": "Permute", 
      "config": {
        "dims": [
          2, 
          1
        ], 
        "trainable": true, 
        "name": "permute_1"
      }
    }, 
    {
      "class_name": "Activation", 
      "config": {
        "activation": "softmax", 
        "trainable": true, 
        "name": "activation_5"
      }
    }
  ]
}